# 1. სიის შექმნა
names = ["Ana", "gio", "vano", "mari", "ani"]

# 2. პირველი ელემენტის ამოღება
names.pop(0)  # "Ana" ამოღებული

# 3. ბოლო ელემენტის ამოღება
names.pop(-1)  # "ani" ამოღებული

print(names)  # შედეგი: ["gio", "vano", "mari"]

# .insert() მეთოდი:
# გამოიყენება ელემენტის სიის კონკრეტულ პოზიციაზე ჩასამატებლად


# .append() მეთოდი:
# სიის ბოლოში ელემენტის დასამატებლად


# .pop() მეთოდი:
# სიის ელემენტის ამოსაღებად მითითებული ინდექსიდან

# .len() ფუნქცია:
# აბრუნებს სიის ელემენტების რაოდენობას



# სიის შექმნა
names = ["Ana", "gio", "vano", "mari", "ani"]

# ახალი სახელის ჩასმა 2 ინდექსზე
names.insert(2, "anamaria")  # "anamaria" დაემატება მეორე პოზიციაზე
print(names)  # ["Ana", "gio", "vano", "mari", "ani"]
