'''შექმენით მინიმუმ 5 ცვლადი, რომლებშიც შეინახავთ თქვენი ოჯახის წევრების სახელებს'''

#ვქმნით ცვლადს რომელშიც შევინახავთ ოჯახის წევრების სახელებს

mother="rusudani"
father="gocha"
sister="qristi"
brother="giorgi"

#ვბეჭდავთ ერთ დიდ წინადადებაში

print("my mother is" + "rusudani")
print("my father is" + "gocha" )
print("my sister is" + "qristi")
print("my brother is" + "giorgi")

'''თქვენი სასურველ რიცხვებს შორის შეასრულეთ და დაბეჭდეთ ოპერაციები, მინიმუმ 5 თითოეულ ოპერატორზე (+,-,*,//)'''

#ვასრულებთ რიცხვებს შორის ოპერაციებს


print( 250 + 167)
print( 234 - 165)
print(765 * 254)
print(1234 // 345)

# ჩვენ შევასრულეთ რიცხვებს შორის მათემატიკური ოპერაციები

