for i in range(11):
    print(i)
#2) გამოიტანეთ რიცხვები 50-დან 150-მდე:

for i in range(50, 151):
    print(i)
#3) გამოიტანეთ მხოლოდ ლუწი რიცხვები 200-დან 500-მდე:

for i in range(200, 501, 2):
    print(i)
#4) გამოიტანეთ კენტი რიცხვები 0-დან 50-მდე:

for i in range(1, 51, 2):
    print(i)
#5) მომხმარებელს შემოატანინეთ მისი გვარი და გამოიტანეთ ამ გვარის თითოეული ასო ცალცალკე:

user_last_name = input("შეიყვანეთ თქვენი გვარი: ")

for letter in user_last_name:
    print(letter)


#6) კომენტარი: როდის ვიყენებთ for ციკლს?
#for ციკლი გამოიყენება მაშინ, როდესაც გვინდა გამოვიყენოთ ცვლადი (ან რამდენიმე ცვლადი) გარკვეული რიცხვითი მნიშვნელობის დიაპაზონში ან სიაში. მაგალითად:

#რიცხვების დაბეჭდვისთვის: როდესაც ვიცით, რომ უნდა გავიმეოროთ მოქმედება გარკვეული რაოდენობის განმავლობაში (მაგალითად, 0-დან 10-მდე რიცხვების დაბეჭდვა).
#სტრინგის ან სიაში სიმბოლოების/ელემენტების გამეორებისთვის: როდესაც გვინდა ვიმუშაოთ რიცხვების ან ასოების ნაკრებთან (მაგალითად, გვარის ასოების ცალცალკე ამოცემა).
#მხოლოდ კონკრეტული პირობების შესრულებისთვის: მაგალითად, ლუწი ან კენტი რიცხვების გამოყოფა.
#for ციკლი საშუალებას გვაძლევს გავიმეოროთ მოქმედება გარკვეული დროის განმავლობაში, რაც განსაკუთრებით სასარგებლოა როცა შეგვიძლია ვიცოდეთ რამდენი დრო უნდა გავატაროთ იმავე პროცესში.#


for i in range(10, 16):
    print(i)
for i in range(50, -1, -1):
    print(i)
counter = 0
while counter < 5:
    print("This is iteration", counter)
    counter += 1  # counter-ის მნიშვნელობის ზრდა
for i in range(10, 71, 2):
    print(i)
for i in range(25, 56, 2):
    print(i)




