"შექმენით პროგრამა, რომელიც მომხარებელს შემოატანინებს სახელს, შემდეგ კი მიესალმება მისი სახელის დაბეჭდვით"

name=input('enter your name: ')
print("hello" + name + ". have a great day" )


'გააკეთეთ კონკატინაციისა და შეკრების მაგალითები თითოეულზე 2, კომენტარებით ახსენით რა არის კონკატინაცია და შეკრება'

# სტრინგების დამატება არის კონკატინაცია
print("mariami" + "berishvili")
# კონკატინაცია იწევევს სტრინგების შეერთებას

# ინტეჯერების დამატებას ეწოდება ჯამი
# ჯამის დროს ხდება მათემატიკური შეკრება
print(23 + 67)

"გააკეთეთ string-ისა და integer-ის დამატების მაგალითი, ახსენით შედეგი"

print(90 +"67")
# სტრინგის დამატება ინტეჯერთან არ შეიძლება












