numbers = [1, 2, 3, 4, 5]  # სია რიცხვებით
product = 1  # ნამრავლი იწყება 1-ით

for num in numbers:
    product *= num  # ყოველი რიცხვი ტარდება ნამრავლში

print("The product of all elements is:", product)  # ბეჭდავს შედეგს

numbers = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]  # სია 10 ელემენტით

# slicing - 0დან 8მდე ინდექსები (9 არ არის ჩართული)
print(numbers[0:9])  


numbers = [3, 6, 2, 8, 1]  # სია რიცხვებით

# for ციკლი თითოეული რიცხვის შემოწმებისათვის
for num in numbers:
    if num < 5:
        print(num)  # დაბეჭდავს იმ რიცხვებს, რომლებიც ნაკლებია 5-ზე


numbers = [5, 10, 15, 20, 25, 30, 35, 40, 45, 50]  # სია რიცხვებით
sum_numbers = 0  # ჯამი იწყება 0-ით

# თითოეული რიცხვის დამატება ჯამში
for num in numbers:
    sum_numbers += num

print("The sum of all numbers is:", sum_numbers)


# slicing-ის მეშვეობით შეგვიძლია:
# 1. სიის ნაწილის ამოღება (slice), მაგალითად: [start:end] - რომლებსაც ინდექსებში range-ის მიხედვით ვუშვებთ.
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(numbers[2:6])  # ამოიღებს ელემენტებს ინდექსებით 2-დან 5-მდე (6 არ ჩასმულია).

# 2. სიის ინვერტირება: [start:end:step] - აქ step ნიშნავს გადახვევა, რომლის მეშვეობითაც შეგვიძლია სიის ელემენტების ინვერტირება.
print(numbers[::-1])  # ინვერტირებული სია (უკუჩვეულო რიგით)


