# OR ოპერატორის მაგალითები
or_example1 = True or False  # შედეგი: True
or_example2 = False or False  # შედეგი: False
or_example3 = 5 > 3 or 2 > 10  # შედეგი: True
or_example4 = 3 == 4 or 7 < 2  # შედეგი: False

# AND ოპერატორის მაგალითები
and_example1 = True and True  # შედეგი: True
and_example2 = True and False  # შედეგი: False
and_example3 = 10 > 5 and 3 < 8  # შედეგი: True
and_example4 = 4 != 4 and 6 >= 2  # შედეგი: False

# მონაცემების შეყვანა მომხმარებლისგან
user_name = input("შეიყვანეთ თქვენი სახელი: ")
user_age = int(input("შეიყვანეთ თქვენი ასაკი: "))
user_height = float(input("შეიყვანეთ თქვენი სიმაღლე (მეტრებში): "))

# პირობის შემოწმება
if user_age > 18 and user_name == "თქვენი_სახელი" and user_height > 1.80:
    print("თქვენ აკმაყოფილებთ ყველა პირობას!")
else:
    print("თქვენ არ აკმაყოფილებთ ერთ ან რამდენიმე პირობას.")



#4) ალგორითმის განმარტება
#ალგორითმი არის დადასტურებული თანმიმდევრული ნაბიჯების კრებული, რომლებიც პრობლემის გადასაჭრელად გამოიყენება. ის შეიძლება იყოს წარმოდგენილი ტექსტურად, დიაგრამის სახით ან კოდით.

#რეალური ცხოვრების მაგალითები:
#ყავის მომზადება:

#აადუღე წყალი.
#მოათავსე ყავა და შაქარი ფინჯანში.
#დაასხი ცხელი წყალი და აურიე.
#სუპერმარკეტში საყიდლების სია:

#წაიღე სია.
#მოძებნე პროდუქტები მაღაზიაში.
#გადაიხადე და დააბრუნე შინ.
#სიგნალიზაციის დაყენება:

#შეიყვანე კოდი.
#გაააქტიურე უსაფრთხოების სისტემა.
#დატოვე შენობა.


